src/cf/DataProcessors/РасчетСтраховыхВзносовИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>РасчетСтраховыхВзносовИП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносаПФР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносаПФРсДоходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносаФФОМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносаФСС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/РасчетСтраховыхВзносовИП/Forms/РасчетСуммыВзносаСДоходов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяВзноса = Параметры.ИмяВзноса;
	Всего     = Параметры.Всего;
	Уплачено  = Параметры.Уплачено;
	Сумма     = Параметры.Сумма;
	
	Период           = КонецКвартала(Параметры.Период);
	Организация      = Параметры.Организация;
	СтруктураДоходов = Параметры.СтруктураДоходов;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.СтруктураДоходов);
	ПредельнаяСуммаВзноса = Параметры.ПредельнаяСуммаВзноса;
	
	ТаблицаПлатежей = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыПлатежей);
	Если ТипЗнч(ТаблицаПлатежей) = Тип("ТаблицаЗначений") Тогда
		Платежи.Загрузить(ТаблицаПлатежей);
	КонецЕсли;
	
	РасчетСтраховыхВзносовИПФормы.ОтобразитьПлатежи(ЭтотОбъект, Платежи, "ДекорацияПлатеж");
	
	Заголовок = Параметры.Заголовок;
	
	УправлениеФормойНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененВидДеятельностиОрганизации" Тогда
		
		Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Организации") И Параметр = Организация Тогда
			ЗаполнитьСтраховыеВзносыНаСервере();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		Если ЗавершениеРаботы Тогда
			Возврат;
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОповеститьОВыбореИЗакрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СуммаДоходаИПНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РежимРасшифровки", Истина);
	СтруктураПараметров.Вставить("Организация",      Организация);
	СтруктураПараметров.Вставить("НачалоПериода",    НачалоГода(Период));
	СтруктураПараметров.Вставить("КонецПериода",     КонецКвартала(Период));
	
	ОткрытьФорму("Отчет.КнигаУчетаДоходовИРасходовПредпринимателя.Форма", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДоходаУСННажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РежимРасшифровки", Истина);
	СтруктураПараметров.Вставить("Организация",      Организация);
	СтруктураПараметров.Вставить("НачалоПериода",    НачалоГода(Период));
	СтруктураПараметров.Вставить("КонецПериода",     КонецКвартала(Период));
	
	ОткрытьФорму("Отчет.КнигаУчетаДоходовИРасходов.Форма", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПотенциальноВозможныйДоходНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", Новый Структура("Владелец", Организация));
	СтруктураПараметров.Вставить("Период", Период);
	
	ОткрытьФорму("Справочник.Патенты.ФормаСписка", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВмененныйДоходНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация",   Организация);
	СтруктураПараметров.Вставить("НачалоПериода", НачалоГода(Период));
	СтруктураПараметров.Вставить("КонецПериода",  КонецКвартала(Период));
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВмененныйДоходПоВидамДеятельностиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ВидыДеятельностиЕНВД.Форма.ВмененныйДоход",
		СтруктураПараметров,
		ЭтотОбъект,
		Истина,
		,
		,
		ОписаниеОповещенияОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВмененныйДоходПоВидамДеятельностиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьСтраховыеВзносыНаСервере();
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьСтраховыеВзносыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ОповеститьОВыбореИЗакрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормойНаСервере()
	
	НачалоПериода = НачалоГода(Период);
	КонецПериода  = КонецГода(Период);
	
	Если УчетнаяПолитика.Существует(Организация, КонецПериода) Тогда
		ПлательщикНДФЛ       = УчетнаяПолитика.ПлательщикНДФЛЗаПериод(Организация, НачалоПериода, КонецПериода);
		ПрименяетсяУСН       = УчетнаяПолитика.ПрименяетсяУСНЗаПериод(Организация, НачалоПериода, КонецПериода);
		ПрименяетсяУСНПатент = УчетнаяПолитика.ПрименяетсяУСНПатентЗаПериод(Организация, НачалоПериода, КонецПериода);
		ПлательщикЕНВД       = УчетнаяПолитика.ПлательщикЕНВДЗаПериод(Организация, НачалоПериода, КонецПериода);
	Иначе
		День = 24 * 60 * 60;
		ПлательщикНДФЛ       = УчетнаяПолитика.ПлательщикНДФЛ(Организация, КонецПериода + День);
		ПрименяетсяУСН       = УчетнаяПолитика.ПрименяетсяУСН(Организация, КонецПериода + День);
		ПрименяетсяУСНПатент = УчетнаяПолитика.ПрименяетсяУСНПатент(Организация, КонецПериода + День);
		ПлательщикЕНВД       = УчетнаяПолитика.ПлательщикЕНВД(Организация, КонецПериода + День);
	КонецЕсли;
	
	
	ВсегоДоходов = СуммаДоходаИП + СуммаДоходаУСН + ВмененныйДоход + ПотенциальноВозможныйДоход;
	
	ДанныеДляРасчета = УчетСтраховыхВзносовИП.ДанныеДляРасчетаСтраховыхВзносовСДоходов(Период, Организация);
	
	Если Период >= УчетСтраховыхВзносовИП.ДатаНачалаУчетаРасходовПриРасчетеСтраховыхВзносовИП()
		И Год(Период) = Год(ОбщегоНазначения.ТекущаяДатаПользователя())
		И ПлательщикНДФЛ Тогда
		
		РасходыНаУплатуСтраховыхВзносовЗаТекущийПериод = УчетДоходовИРасходовПредпринимателя.РасходыНаУплатуСтраховыхВзносовЗаТекущийПериод(Организация, Период);
		ВсегоДоходов = ВсегоДоходов + РасходыНаУплатуСтраховыхВзносовЗаТекущийПериод;
		ФиксированнаяЧастьВзносов = ДанныеДляРасчета.ФиксированнаяЧастьПФР + ДанныеДляРасчета.ФиксированнаяЧастьФФОМС;
		
		ДекорацияФормулаРасчета = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("=  ( %1 - %2 - %3 ) x %4",
			Формат(ВсегоДоходов, "Л=ru; ЧЦ=15; ЧДЦ=2; ЧН=0,00"),
			Формат(ФиксированнаяЧастьВзносов, "Л=ru; ЧЦ=7; ЧДЦ=2; ЧН=0,00"),
			Формат(ДанныеДляРасчета.ПорогДоходов, "Л=ru; ЧЦ=8; ЧДЦ=2; ЧН=0,00"),
			Формат(ДанныеДляРасчета.ПроцентВзносов, "ЧЦ=3; ЧДЦ=; ЧН=0")+ "/" + Формат(100 + ДанныеДляРасчета.ПроцентВзносов, "ЧЦ=3; ЧДЦ=; ЧН=0"));
			
		Элементы.ФиксированнаяЧастьВзносов.Видимость = Истина;
	Иначе
		ДекорацияФормулаРасчета = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("=  ( %1 - %2 ) x %3",
			Формат(ВсегоДоходов, "Л=ru; ЧЦ=15; ЧДЦ=2; ЧН=0,00"),
			Формат(ДанныеДляРасчета.ПорогДоходов, "Л=ru; ЧЦ=8; ЧДЦ=2; ЧН=0,00"),
			Формат(ДанныеДляРасчета.ПроцентВзносов, "ЧЦ=1; ЧДЦ=; ЧН=0")+ "%");
		Элементы.ФиксированнаяЧастьВзносов.Видимость = Ложь;
	КонецЕсли;
	
	// Суммы доходов по видам деятельности
	
	Элементы.Всего.Подсказка = ?(ПредельнаяСуммаВзноса, НСтр("ru = ' (предельная сумма взноса)'"), "");
	Элементы.ДекорацияФормулаРасчета.Видимость = Не ПредельнаяСуммаВзноса;
	
	НесколькоВидовДеятельности = (ПлательщикНДФЛ + ПрименяетсяУСН + ПлательщикЕНВД + ПрименяетсяУСНПатент) > 1;
	
	Элементы.СуммаДоходаИП.Видимость = ПлательщикНДФЛ;
	Элементы.СуммаДоходаУСН.Видимость = ПрименяетсяУСН;
	Элементы.ВмененныйДоход.Видимость = ПлательщикЕНВД;
	Элементы.ПотенциальноВозможныйДоход.Видимость = ПрименяетсяУСНПатент;
	
	Элементы.ГруппаСуммаДоходов.Отображение = ?(НесколькоВидовДеятельности,
		ОтображениеОбычнойГруппы.ОбычноеВыделение, ОтображениеОбычнойГруппы.Нет);
	Элементы.ВсегоДоходов.Видимость = НесколькоВидовДеятельности;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Форма.Остаток = Форма.Всего - Форма.Уплачено - Форма.Сумма;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтраховыеВзносыНаСервере()
	
	Периодичность = УчетСтраховыхВзносовИП.ПериодичностьУплатыФиксированныхСтраховыхВзносов(Организация, Период);
	
	// Доходы по видам деятельности
	СтруктураДоходов = УчетСтраховыхВзносовИП.СтруктураДоходовПоВидамДеятельности(
		Организация, НачалоГода(Период), КонецКвартала(Период));
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураДоходов);
	
	// Страховые взносы, исчисленные с суммы доходов
	СтраховыеВзносыСДоходовКУплате = УчетСтраховыхВзносовИП.СтраховыеВзносыСДоходовКУплате(
		Организация, Период, Периодичность, СтруктураДоходов, Ложь);
	
	ПредельнаяСуммаВзноса = СтраховыеВзносыСДоходовКУплате.ПредельнаяСуммаВзноса;
	Всего                 = СтраховыеВзносыСДоходовКУплате.СуммаВзносаПФРсДоходовВсего;
	Уплачено              = СтраховыеВзносыСДоходовКУплате.СуммаВзносаПФРсДоходовУплачено;
	Сумма                 = СтраховыеВзносыСДоходовКУплате.СуммаВзносаПФРсДоходов;
	
	ТаблицаПлатежей = СтраховыеВзносыСДоходовКУплате.СтраховыеВзносыУплаченные;
	Если ТаблицаПлатежей <> Неопределено Тогда
		ТаблицаПлатежей.Колонки.ДокументОплаты.Имя = "Ссылка";
		ТаблицаПлатежей.Колонки.НомерДокументаОплаты.Имя = "Номер";
		ТаблицаПлатежей.Колонки.ДатаДокументаОплаты.Имя = "Дата";
		Платежи.Загрузить(ТаблицаПлатежей);
	КонецЕсли;
	
	РасчетСтраховыхВзносовИПФормы.ОтобразитьПлатежи(ЭтотОбъект, Платежи, "ДекорацияПлатеж");
	
	УправлениеФормойНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОВыбореИЗакрыть()
	
	ЗначениеВыбора = Новый Структура;
	ЗначениеВыбора.Вставить(ИмяВзноса, Сумма);
	ЗначениеВыбора.Вставить("СтруктураДоходов", СтруктураДоходов);
	
	Модифицированность = Ложь;
	ОповеститьОВыборе(ЗначениеВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ДекорацияПлатежНажатие(Элемент)
	
	РасчетСтраховыхВзносовИПФормыКлиент.ПлатежНажатие(Элемент.Имя, Платежи, "ДекорацияПлатеж");
	
КонецПроцедуры

#КонецОбласти
